HHH-01/STM32-with-sensors/Source Code/Sensor_Things/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Temp_sensor_Pin GPIO_PIN_3
#define Temp_sensor_GPIO_Port GPIOA
#define LD1_Green_Pin GPIO_PIN_0
#define LD1_Green_GPIO_Port GPIOB
#define LD3_Red_Pin GPIO_PIN_14
#define LD3_Red_GPIO_Port GPIOB
#define PIR_Sen_Pin GPIO_PIN_8
#define PIR_Sen_GPIO_Port GPIOC
#define PIR_Sen_EXTI_IRQn EXTI9_5_IRQn
#define LCD_RS_Pin GPIO_PIN_1
#define LCD_RS_GPIO_Port GPIOD
#define LCD_PD3_Pin GPIO_PIN_3
#define LCD_PD3_GPIO_Port GPIOD
#define LCD_DB6_Pin GPIO_PIN_4
#define LCD_DB6_GPIO_Port GPIOD
#define LCD_DB5_Pin GPIO_PIN_5
#define LCD_DB5_GPIO_Port GPIOD
#define LCD_DB4_Pin GPIO_PIN_6
#define LCD_DB4_GPIO_Port GPIOD
#define LCD_En_Pin GPIO_PIN_7
#define LCD_En_GPIO_Port GPIOD
#define LD2_Blue_Pin GPIO_PIN_7
#define LD2_Blue_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
